In [1]:
import pandas as pd

In [2]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [3]:
departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [4]:
pd.merge(employees, departments, on="DeptID")

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [5]:
pd.merge(employees, departments, on="DeptID", how="left") # left join

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [6]:
pd.merge(employees, departments, on="DeptID", how="right") # right join

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [7]:
pd.merge(employees, departments, on="DeptID", how="outer") # outer join

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [11]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"], "score": [423, 633]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"], "age": [45, 52]})

In [12]:
pd.concat([df1, df2])

      Name  score   age
0    Alice  423.0   NaN
1      Bob  633.0   NaN
0  Charlie    NaN  45.0
1    David    NaN  52.0

In [13]:
pd.concat([df1, df2], axis = 1)

    Name  score     Name  age
0  Alice    423  Charlie   45
1    Bob    633    David   52